public class hw1 {
//    Сдавайте задание в виде скриншота, пожалуйста. Один скриншот - одно задание.
//    Если кода много - то ссылка на pastebin или ваш гитхаб с дз. В случае с литкодом, скриншот с успешной сдачей вместе с кодом.
//        1. Разобраться с задачей про исполнителя (разбиралась последней на семинаре)
//        2. Попробовать сгенерировать все перестановки длины N из K чисел с повторениями. Пример: N = 2, K = 3 ответ "00 01 02 10 11 12 20 21 22"
//    Пара легких задач для разогрева:
//    https://leetcode.com/problems/build-array-from-permutation/
//    https://leetcode.com/problems/subtract-the-product-and-sum-of-digits-of-an-integer/ - сделать без использования строк, математически. Читаем последнюю цифру (остаток от деления), затем отсекаем ее (деление на ..)
}
